var initialWeight = 6000; // Исходный вес в граммах
var targetWeight = 5000; // Желанный вес в граммах
var weight = initialWeight;
var days = 0;
while(weight >= targetWeight){
  console.log('Текущий вес: ' + weight);
  if(weight === targetWeight) {
    break;
    } 
    else {
      weight =  weight - (weight / 100) * 5;
      days += 1;
      }
  }
  console.log(days)
/*

Мяу! Меня утомляют диета и тренировки, поэтому я хочу узнать, сколько ещё дней осталось заниматься, чтобы добиться нужного веса к мероприятию.

Входные данные: вес в начале и вес в конце.

Логика работы: если я тренируюсь и сижу на диете, то теряю 5% своей массы в день (на сухом корме не особо пожируешь, а тренировки суровые).

Просто посчитай, сколько дней понадобится провести в таком режиме и запиши количество в переменную days.

*/
